mwarnes/epaper-homeassistant-dashboard/sdkconfig.defaults
# ESP32-S3 specific
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# PSRAM (required for LVGL + e-paper buffers)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# LWIP (for HTTP client)
CONFIG_LWIP_MAX_SOCKETS=10

# HTTP Client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# SNTP
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# Watchdog - disable IDLE monitoring (long-running tasks block idle on both cores)
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# LVGL Configuration
# Memory - increase significantly for e-paper display (large framebuffers)
CONFIG_LV_MEM_SIZE_KILOBYTES=256
CONFIG_LV_MEM_POOL_EXPAND_SIZE_KILOBYTES=64
CONFIG_LV_COLOR_DEPTH_24=y

# LVGL Logging (for debugging)
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_INFO=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_LOG_TRACE_DISP_REFR=y
